Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/travel_and_recreation/motoring_1/driver_licensing/index.html.txt.tmx
Source language: en
Languages: ga

source: Learner driving permits for cars and work vehicles
ga: Ceadúnais tiomána foghlaimeora le haghaidh carranna agus feithiclí oibre

source: It is a legal requirement to hold a learner driving permit before learning to drive a car or work vehicle on public roads in Ireland
ga: Ní mór de réir an dlí ceadúnas sealadach tiomána a bheith agat roimh dul ag tiomáint ar na bóithre poiblí.Teastaíonn ceadúnas sealadach freisin leis an scrúdú tiomána a dhéanamh

source: Applying for a driving licence
ga: Iarratas a dhéanamh ar cheadúnas tiomána

source: Driving licences are issued if you pass a driving test. Rules about driving licences, forms and how to apply
ga: Tá tú i dteideal cur isteach ar cheadúnas iomlán tiomána má éiríonn leat i scrúdú tiomána

source: Updating your driving licence or learner permit
ga: Do cheadúnas tiomána nó do cheadúnas foghlaimeora a nuashonrú

source: If you change your name or address, you can exchange your current driving licence or learner permit for an updated one
ga: Má athraíonn tú d’ainm nó do sheoladh baile, féadfaidh tú do cheadúnas tiomána reatha nó do cheadúnas foghlaimeora reatha a mhalartú ar cheadúnas nuashonraithe

source: Renewing your driving licence
ga: Do cheadúnas tiomána a athnuachan

source: When your driving licence expires you must renew it if you still want to drive
ga: Nuair a éagann do cheadúnas tiomána ní mór duit é a athnuachan má tá tú fós ag iarraidh tiomáint

source: Replacing a lost, stolen or damaged driving licence or learner permit
ga: Ag athsholáthar ceadúnais tiomána Éireannaigh ar cailleadh nó ar goideadh é

source: If your most recent driving licence or learner permit has been lost or stolen but is still valid, you can obtain a replacement
ga: Dá mba rud é gur cailleadh nó gur goideadh an ceadúnas tiomána Éireannach is deireanaí agat, is féidir leat ceann ionadach a fháil

source: Categories of motor vehicles and minimum age of drivers
ga: Catagóirí na mótarfheithiclí agus íos-aois na dtiománaithe

source: Information is provide on categories of vehicles and the minimum age you need to be in order to legally drive them
ga: Roinntear na mótarfheithiclí in Éirinn ina gcatagóirí éagsúla chun críoch cheadúnú na dtiománaithe

source: Learner driving permits for motorcycles
ga: Ceadúnais tiomána foghlaimeora le haghaidh gluaisrothar

source: Before you learn to drive a motorcycle on a public road in Ireland, you must obtain a learner driving permit for the vehicle you wish to drive
ga: Sula bhfoghlaimíonn tú le gluaisrothar a thiomáint ar bhóthar poiblí in Éirinn, ní mór duit ceadúnas sealadach tiomána a fháil don fheithicil gur mian leat a thiomáint

source: Learner driving permits for buses and trucks
ga: Ceadúnais foghlaimeora le haghaidh busanna agus trucailí

source: Before you learn to drive a bus or truck on a public road in Ireland, you must obtain a learner driving permit for the type of vehicle you wish to drive
ga: Sula dtosaíonn tú ag foghlaim chun bus nó trucail a thiomáint ar bhóthar poiblí in Éirinn, ní mór duit ceadúnas tiomána foghlaimeora a bheith agat don chineál feithicle is mian leat a thiomáint

source: Learner driving permits for trailers
ga: Ceadúnais tiomána foghlaimeora le haghaidh leantóirí

source: Before you learn to drive while pulling a trailer that weighs more than 750kg, you must obtain a learner driving permit
ga: Sula bhfoghlaimíonn tú tiomáint agus tú ag tarraingt leantóir atá meáchan níos mó ná 750kg aige, ní mór duit ceadúnas tiomána foghlaimeora a fháil

source: Converting your driving licence to an Irish driving licence
ga: Do cheadúnas tiomána a athrú go ceadúnas tiomána Éireannach

source: How to exchange a driving licence issued in another country for an Irish driving licence, including information on the fees and a list of recognised exchange countries
ga: Chonas ceadúnas tiomána eisithe i dtír eile a mhalartú ar son ceadúnais tiomána Eireannaigh

source: An international driving permit allows you to drive in foreign countries without further tests or applications. Find out how to apply for a permit, the costs involved and those countries in which you can use your permit
ga: Tá cur síos sa cháipéis seo ar an gceadúnas tiomána idirnáisiúnta a thugann cead do dhuine tiomáint i dtíortha thar lear gan aon scrúdú ná iarratas breise a dhéanamh

source: Most Read in "Travel and Recreation"
ga: Ábhar is mó éilimh i "Taisteal agus Áineas"

source: Applying for your first Irish passport
ga: Ag déanamh iarratais ar phas Éireannach

source: Renewing an Irish passport
ga: Pas Éireannach a athnuachan
